rails/app/controllers/images_controller.rb

	def index
		respond_with Image.all
---
SELECT "images".* FROM "images"