rails/app/controllers/parts_controller.rb

	def index
		respond_with Part.all
---
SELECT "parts".* FROM "parts"